scripts/stress_test/stress_test_no_ram_fs_no_thread_pool.txt
Connections: 5
Running 10s test @ http://localhost:8180/
  4 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.94ms    2.82ms  33.85ms   58.92%
    Req/Sec    49.87      6.56    70.00     63.00%
  1996 requests in 10.02s, 547.56KB read
Requests/sec:    199.28
Transfer/sec:     54.67KB
Connections: 10
Running 10s test @ http://localhost:8181/
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.53ms    5.54ms  70.55ms   72.85%
    Req/Sec    65.24      9.39    80.00     75.00%
  2615 requests in 10.04s, 716.66KB read
Requests/sec:    260.37
Transfer/sec:     71.36KB
Connections: 20
Running 10s test @ http://localhost:8182/
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.51ms   31.37ms 288.24ms   68.48%
    Req/Sec    59.91     19.27   150.00     67.50%
  2413 requests in 10.08s, 661.32KB read
  Socket errors: connect 0, read 4, write 0, timeout 0
  Non-2xx or 3xx responses: 4
Requests/sec:    239.31
Transfer/sec:     65.59KB
Connections: 50
Running 10s test @ http://localhost:8183/
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   238.97ms  196.75ms   1.90s    83.70%
    Req/Sec    49.94     23.86   160.00     76.13%
  1996 requests in 10.05s, 547.72KB read
Requests/sec:    198.62
Transfer/sec:     54.50KB
Connections: 100
Running 10s test @ http://localhost:8184/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   497.22ms  423.69ms   2.00s    71.46%
    Req/Sec    37.61     22.48   138.00     77.10%
  1495 requests in 10.05s, 410.09KB read
  Socket errors: connect 0, read 1, write 0, timeout 37
  Non-2xx or 3xx responses: 1
Requests/sec:    148.80
Transfer/sec:     40.82KB
Connections: 200
Running 10s test @ http://localhost:8185/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   596.50ms  512.30ms   1.99s    68.87%
    Req/Sec    30.80     22.23   178.00     86.87%
  1159 requests in 10.04s, 317.36KB read
  Socket errors: connect 0, read 4, write 0, timeout 131
  Non-2xx or 3xx responses: 4
Requests/sec:    115.38
Transfer/sec:     31.59KB
Connections: 500
Running 10s test @ http://localhost:8186/
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   840.81ms  549.61ms   1.99s    57.75%
    Req/Sec    22.07     13.35    80.00     79.83%
  820 requests in 10.06s, 225.00KB read
  Socket errors: connect 0, read 0, write 0, timeout 323
Requests/sec:     81.48
Transfer/sec:     22.36KB
Connections: 1000
Running 10s test @ http://localhost:8187/
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   846.43ms  589.24ms   1.89s    54.05%
    Req/Sec    14.61     10.67    50.00     71.30%
  386 requests in 10.08s, 97.47KB read
  Socket errors: connect 0, read 52, write 0, timeout 164
  Non-2xx or 3xx responses: 52
Requests/sec:     38.28
Transfer/sec:      9.67KB